--------Исполнители---------------------

INSERT INTO 
    Perfomers
VALUES
    (1, 'Макс Корж'),
    (2, 'Баста'),
    (3, 'Григорий Лепс'),
    (4, 'Полина Гагарина'),
    (5, 'Клава Кока'),
    (6, 'МОТ'),
    (7, 'Король и шут'),
    (8, 'Тимати');

--------------Жанры--------------------------------

INSERT INTO 
    Genres
VALUES
    (1, 'Хип-хоп'),
    (2, 'Поп-музыка'),
    (3, 'Шансон'),
    (4, 'Рок'),
    (5, 'Рэп');
    
----------------связь между жанрами и исполнителями------------------------------

INSERT INTO 
    genresperfomers
VALUES
    (1, 4),
    (1, 5),
    (2, 4),
    (2, 5),
    (2, 6),
    (2, 1),
    (3, 3),
    (4, 7),
    (5, 2),
    (5, 8);

----------Альбомы--------------------

INSERT INTO 
    Albums(album_id, album_title, release_date)
VALUES
    (1, 'Транзит', '2022-02-02'),
    (2, 'Ты была права', '2018-02-02'),
    (3, 'The best', '2020-02-02'),
    (4, 'Жить в кайф', '2012-02-02'),
    (5, 'Вдох', '2013-02-02'),
    (6, 'Сопранно', '2014-02-02'),
    (7, 'Как в старой сказке', '2001-02-02'),
    (8, 'Краш', '2016-02-02');

----------------связь между альбомами и исполнителями------------------------------

INSERT INTO 
    albumsperfomers
VALUES
    (1, 8),
    (2, 5),
    (3, 4),
    (4, 5),
    (5, 6),
    (6, 1),
    (7, 3),
    (8, 7),
    (5, 2),
    (5, 8);

----------------Треки------------------------------

INSERT INTO 
    tracks
VALUES
    (1, 1, 'Locomy', 240),
    (2, 1, 'Харлей', 214),
    (3, 1, 'Звездопад', 170),
    (4, 2, 'Ты была права', 118),
    (5, 3, 'Рюмка водка на столе', 263),
    (6, 3, 'Водопадом', 259),
    (7, 3, 'Натали', 288),
    (8, 3, 'Лондон', 263),
    (9, 4, 'Жить в кайф', 174),
    (10, 4, 'Амстердам', 246),
    (11, 4, 'Мотылек', 236),
    (12, 5, 'Вдох', 181),
    (13, 6, 'Сопранно', 191),
    (14, 7, 'Гимн шута', 300),
    (15, 8, 'Краш мой', 203);
    
-------сборники--------------------------

INSERT INTO 
    Collections
VALUES
    (1,'Лучшее рок', '2019-02-02'),
    (2,'Хиты', '2003-12-02'),
    (3,'Новые хиты', '2006-02-02'),
    (4,'Старые хиты', '2012-12-22'),
    (5,'Новинки', '2002-02-02'),
    (6,'Новая эра', '2013-02-01'),
    (7,'Лучшее', '2020-01-02'),
    (8,'Русский рэп', '2018-12-02');
    
--------------------cвязь между сборниками и треками----------------------------

INSERT INTO 
    collectiontracks
VALUES
    (1, 14),
    (3, 15),
    (4, 5),
    (5, 10),
    (6, 8),
    (7, 7),
    (8, 1),
    (8, 4),
    (2, 3);
    
